updated design diagrams
